In [1]:
import pandas as pd
import seaborn

In [2]:
# Data 로딩 ----------------------------------------------
df = seaborn.load_dataset('titanic')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

# 성별, 등석, 나이에 따른 생존율

In [5]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
df['sex'].unique()

array(['male', 'female'], dtype=object)

In [9]:
df['survived'].unique()

array([0, 1])

In [11]:
len((df['sex']=='male')&(df['survived']==1))

891

In [12]:
len((df['sex']=='male'))

891

In [13]:
df['sex']=='male'

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: sex, Length: 891, dtype: bool

In [14]:
df['survived']==1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: survived, Length: 891, dtype: bool

In [15]:
df[(df['sex']=='male')&(df['survived']==1)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
36,1,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
55,1,1,male,NaN,0,0,35.5000,S,First,man,True,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
838,1,3,male,32.0,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
839,1,1,male,NaN,0,0,29.7000,C,First,man,True,C,Cherbourg,yes,True
857,1,1,male,51.0,0,0,26.5500,S,First,man,True,E,Southampton,yes,True
869,1,3,male,4.0,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [19]:
len(df[(df['sex']=='male')&(df['survived']==1)])/len(df[df['sex']=='male'])

0.18890814558058924

In [16]:
len(df[df['sex']=='male'])

577

In [18]:
len(df[(df['sex']=='male')&(df['survived']==1)])

109

In [20]:
def survive_rate(df ,col, e):
    s_rate=len(df[(df[col]==e)&(df['survived']==1)])/len(df[df[col]==e])
    return s_rate

## 남성 생존율

In [21]:
survive_rate(df ,'sex', 'male')

0.18890814558058924

## 여성 생존율

In [22]:
survive_rate(df ,'sex', 'female')

0.7420382165605095

In [24]:
df['pclass'].unique()

array([3, 1, 2])

## 1등석 생존율

In [26]:
survive_rate(df ,'pclass', 1)

0.6296296296296297

## 2등석 생존율

In [27]:
survive_rate(df ,'pclass', 2)

0.47282608695652173

## 3등석 생존율

In [28]:
survive_rate(df ,'pclass', 3)

0.24236252545824846

In [30]:
df['age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [42]:
df_fn_age['age']=df['age'].fillna(0)
df_fn_age['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [37]:
df_fn_age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [43]:
df_fn_age['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [44]:
df_fn_age['age'].max()

80.0

In [45]:
df_fn_age['age'].min()

0.0

In [80]:
df_fn_age['age_lable']=pd.cut(x=df_fn_age['age'], 
                           bins=8, 
                           labels=['0~10', '10~20', '20~30', '30~40', '40~50', '50~60', '60~70', '70~80'],
                            include_lowest=False)

In [83]:
df_fn_age['age_lable']

0      20~30
1      30~40
2      20~30
3      30~40
4      30~40
       ...
886    20~30
887    10~20
888     0~10
889    20~30
890    30~40
Name: age, Length: 891, dtype: category
Categories (8, object): ['0~10' < '10~20' < '20~30' < '30~40' < '40~50' < '50~60' < '60~70' < '70~80']

In [82]:
df_fn_age['survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [84]:
con_df_age_sur=pd.concat([df_fn_age['age_lable'], df_fn_age['survived']], axis=1)

In [85]:
con_df_age_sur

       age  survived
0    20~30         0
1    30~40         1
2    20~30         1
3    30~40         1
4    30~40         0
..     ...       ...
886  20~30         0
887  10~20         1
888   0~10         0
889  20~30         1
890  30~40         0

[891 rows x 2 columns]

In [49]:
df_fn_age['survived']=df['survived'].copy()

## 0~10 생존율

In [86]:
survive_rate(con_df_age_sur ,'age', '0~10')

0.37344398340248963

## 10~20 생존율

In [87]:
survive_rate(con_df_age_sur ,'age', '10~20')

0.3826086956521739

## 20~30 생존율

In [88]:
survive_rate(con_df_age_sur ,'age', '20~30')

0.3652173913043478

## 30~40 생존율

In [89]:
survive_rate(con_df_age_sur ,'age', '30~40')

0.44516129032258067

## 40~50 생존율

In [90]:
survive_rate(con_df_age_sur ,'age', '40~50')

0.38372093023255816

## 50~60 생존율

In [91]:
survive_rate(con_df_age_sur ,'age', '50~60')

0.40476190476190477

## 60~70 생존율

In [92]:
survive_rate(con_df_age_sur ,'age', '60~70')

0.23529411764705882

## 70~80 생존율

In [93]:
survive_rate(con_df_age_sur ,'age', '70~80')

0.2